JerrickRowe/stm32-bootloader/projects/STM32F407-OWL/source/main.c
/**
 *******************************************************************************
 * STM32L4 Bootloader
 *******************************************************************************
 * @author Akos Pasztor
 * @file   main.c
 * @brief  Main program
 *	       This file demonstrates the usage of the bootloader.
 *
 * @see    Please refer to README for detailed information.
 *******************************************************************************
 * Copyright (c) 2020 Akos Pasztor.                     https://akospasztor.com
 *******************************************************************************
 */ 

#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_ll_rcc.h"
#include "main.h"
#include "bootloader.h"
#include "tea.h"
#include "ff.h"
#include "led.h"
#include "bsp_WS2812x.h"
#include "bsp_driver_sd.h"
#include "Indicator.h"
#include <assert.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>

#include "git.h"

#include "testcases.h"

#include "usbd_msc_core.h"
#include "usbd_usr.h"
#include "usbd_desc.h"

#include "bsp_power.h"

#define DECRYPTION_ENABLED	1

#define OWL_RC_UPGRADE_FILESIZE			(0xA000)
#define OWL_UPGRADE_FILESIZE			((APP1_SIZE)+4u)
#define COMBINED_UPGRADE_FILESIZE 		(OWL_UPGRADE_FILESIZE + OWL_RC_UPGRADE_FILESIZE)

#define DEBUG 1
#if DEBUG
#include <stdio.h>
#define PRINT_RAW(fmt,...)	printf( fmt,##__VA_ARGS__ )
#define PRINT_INF(fmt,...)	printf( fmt"\r\n",##__VA_ARGS__ )
#define PRINT_ERR(fmt,...)	printf( fmt"\r\n",##__VA_ARGS__ )
#else
#define PRINT_RAW(fmt,...)	
#define PRINT_INF(fmt,...)	
#define PRINT_ERR(fmt,...)	
#endif


/* Private variables ---------------------------------------------------------*/
static uint8_t BTNcounter = 0;

#define VER		0

#define REV		1

#define PRJ_STR	"FlyFire-bootloader"

/* External variables --------------------------------------------------------*/
char  SDPath[4] = "SD:"; /* SD logical drive path */
FATFS SDFatFs;   /* File system object for SD logical drive */
FIL   SDFile;    /* File object for SD */
static FIL upgrade_file;

/* Private variables ---------------------------------------------------------*/
bool renew_freefile = false;

/* Function prototypes -------------------------------------------------------*/

void    Enter_Bootloader(void);
void    SD_DeInit(void);
void    SD_Eject(void);
void    GPIO_Startup(void);
void    Console_Init(void);
void    Console_DeInit(void);
void    GPIO_DeInit(void);
void    SystemClock_Config(void);
void    Error_Handler(void);
void    print(const char* str);

/* Private functions ---------------------------------------------------------*/
const char *months[] = {
	  "Jan", "Feb", "Mar", "Apr", "May", "Jun"
	, "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"
};
void getBuildTimeStr_YYYYMMDDhhss(char *pDes){
	char strDate [] = __DATE__;
	char strTime [] = __TIME__;
	unsigned char i;
	unsigned int month, day, hour, minute, year;

	*(strTime + 2) = 0;
	*(strTime + 5) = 0;
	hour = atoi(strTime);
	
	minute = atoi(strTime+3);
	year = atoi(strDate + 9);
	
	*(strDate + 6) = 0;
	day = atoi(strDate + 4);
	*(strDate + 3) = 0;
	for (i = 0; i < 12; i++){
		if (!strcmp(strDate, months[i])){
			month = i + 1;
			sprintf( pDes, "20%02d%02d%02d%02d%02d", year, month, day, hour, minute );
			return;
		}
	}
}


const char* get_version_string( void ){
	static char str[500];
	print( "\n\n\n\n\n\r" 
		"______  _        ______  _             \r\n"
		"|  ___|| |       |  ___|(_)            \r\n"
		"| |_   | | _   _ | |_    _  _ __   ___ \r\n"
		"|  _|  | || | | ||  _|  | || '__| / _ \\\r\n"
		"| |    | || |_| || |    | || |   |  __/\r\n"
		"\\_|    |_| \\__, |\\_|    |_||_|    \\___|\r\n"
		"            __/ |                      \r\n"
		"           |___/                       \r\n"
	);
	snprintf( str, sizeof(str), "%s-V%d.%d-%s-", PRJ_STR, VER, REV, GIT_COMMIT_HEAD );
	getBuildTimeStr_YYYYMMDDhhss(str+strlen(str));
	return str;
}




/**
  * @brief This function is called to increment  a global variable "uwTick"
  *        used as application time base.
  * @note In the default implementation, this variable is incremented each 1ms
  *       in SysTick ISR.
 * @note This function is declared as __weak to be overwritten in case of other 
  *      implementations in user file.
  * @retval None
  */
static uint32_t tick;
inline void HAL_IncTick(void)
{
	tick ++;
	if( tick % 25 == 0 ){
		led_poll();
	}
}

/**
  * @brief Provides a tick value in millisecond.
  * @note This function is declared as __weak to be overwritten in case of other 
  *       implementations in user file.
  * @retval tick value
  */
uint32_t HAL_GetTick(void)
{
  return tick;
}

FRESULT scan_files ( char* path ){       /* Start node to be scanned (***also used as work area***) */
    FRESULT res;
    DIR dir;
    UINT i;
    static FILINFO fno;

    res = f_opendir(&dir, path);                       /* Open the directory */
    if (res == FR_OK) {
        for (;;) {
            res = f_readdir(&dir, &fno);                   /* Read a directory item */
            if (res != FR_OK || fno.fname[0] == 0) break;  /* Break on error or end of dir */
            if (fno.fattrib & AM_DIR) {                    /* It is a directory */
                i = strlen(path);
                sprintf(&path[i], "/%s", fno.fname);
                res = scan_files(path);                    /* Enter the directory */
                if (res != FR_OK) break;
                path[i] = 0;
            } else {                                       /* It is a file. */
				PRINT_RAW("%u/%02u/%02u %02u:%02u ""%4u%c ""%s/%s\r\n"
              	, (fno.fdate>>9)+1980, fno.fdate>>5&15, fno.fdate&31
                , fno.ftime>>11, fno.ftime>>5&63
				, fno.fsize>1024?(fno.fsize>1048576?fno.fsize/1048576:fno.fsize/1024):fno.fsize
				, fno.fsize>1024?(fno.fsize>1048576?'M':'K'):'B'
				, path, fno.fname
				);
            }
        }
        f_closedir(&dir);
    }
    return res;
}

int ls( int argc, char** argv ){
    FRESULT  res;
	DIR dir;
	FILINFO fno;
	char path[100] = "SD:";
	int i;
	scan_files( path );
	return 0;
}


