JerrickRowe/stm32-bootloader/projects/STM32F407-OWL/source/main.c
int testcase_4 ( void );

bool MountFilesystem( void ){
	// testcase_4();
	
    PRINT_RAW("Mount SD card and FatFS........");
    FRESULT  res;
    UINT     num;
    uint8_t  i;
    uint8_t  status;
    uint64_t data;
    uint32_t cntr;
    uint32_t addr;
    char     msg[40] = {0x00};

    /* Mount SD card */
    res = f_mount(&SDFatFs, (TCHAR const*)SDPath, 1);
    if(res != FR_OK){
        /* f_mount failed */
        PRINT_INF("MNT_FAILED [0x%02X]",res);
        return false;
    }
    PRINT_INF("DONE");
	return true;
}



void led_toggling( uint32_t rgb1, uint32_t rgb2, uint32_t interval_ms ){
	static uint32_t toggle_timestamp = 0;
	if( HAL_GetTick() - toggle_timestamp > interval_ms ){
		toggle_timestamp = HAL_GetTick();
		static bool toggle = false;
		if( toggle ){
			toggle = false;
			led_setAllRGB( rgb1 );
		}else{
			toggle = true;
			led_setAllRGB( rgb2 );
		}
	}
}

void led_filling( uint32_t rgb, uint32_t interval_ms ){
	static uint32_t timestamp = 0;
	if( HAL_GetTick() - timestamp > interval_ms ){
		timestamp = HAL_GetTick();
		static int step = 0;
		switch( step ){
		case 0:
			led_setRGB( 0, rgb );
			break;
		case 1:
			led_setRGB( 1, rgb );
			break;
		case 2:
			led_setRGB( 2, rgb );
			break;
		case 3:
			led_setAllRGB( 0 );
			break;
		}
		if( ++step > 3 ){
			step = 0;
		}
	}
}


void Copy_App2_To_App1( void ){
	PRINT_RAW("Copy App2 to App1.");
	
	Bootloader_FlashBegin();
	
	uint32_t cnt = 0;
	
	while( cnt < ((APP2_SIZE+4) / 4 ) ){
		uint32_t data = *(uint32_t *)(APP2_ADDRESS + (cnt*4));
		uint8_t  status;
		status = Bootloader_FlashNextWord(data);
		if( cnt % 9830 == 0 ){
			PRINT_RAW(".");
		}
		cnt ++;
	}
	
	Bootloader_FlashEnd();
	
#if(USE_CHECKSUM)
	// Verify application checksum 
	if(Bootloader_IsApp2ChecksumValid() != BL_OK){
		PRINT_RAW("FAILED");
	}else{
		PRINT_RAW("DONE");
	}
#endif
	PRINT_RAW("\r\n");
}


bool Copy_File_To_App1( FIL* fp ){
	FRESULT res;
	UINT br = 0;
	uint8_t buff[512];
	PRINT_INF("Copy file to App1:");
	PRINT_RAW("  Copy.");
	f_rewind(fp);
	uint32_t scan = 0;
	uint32_t boundary = (APP1_SIZE+4)/512;
	led_setAllRGB( RGB(0xAD,0x3D,0x00) );
	HAL_Delay(100);
	Bootloader_FlashBegin();
	for( scan=0; scan<boundary; scan++ ){
		res = f_read( fp, buff, 512, &br );
		if(res!=FR_OK || br!=512){
			PRINT_ERR( "  f_read error [0x%02X] byte read=%d", res, br );
			Bootloader_FlashEnd();
			return false;
		}
		// Decryption 
	#if DECRYPTION_ENABLED
		btea_decrpyt(buff,TEA_key);
	#endif
		// Copy
		uint32_t cnt = 0;
		for( cnt=0; cnt<512/4; cnt++ ){
			uint32_t data = ((uint32_t*)buff)[cnt];
			uint8_t  status;
			status = Bootloader_FlashNextWord(data);
			if( status != BL_OK ){
				PRINT_RAW("Failed\r\n");
				Bootloader_FlashEnd();
				return false;
			}
		}
		if( scan%64 == 0 ){
			PRINT_RAW( "." );
		}
		led_filling( RGB(0xAD,0x3D,0x00), 150 );
	}
	Bootloader_FlashEnd();
	PRINT_RAW("Done\r\n");
	return true;
}


bool VerifyUpgradeFile( FIL* fp ){
	FRESULT res;
	UINT br = 0;
	uint8_t buff[512];
	PRINT_INF("Verifying upgrade file:");

	if( f_size( fp ) < OWL_UPGRADE_FILESIZE ){
		PRINT_ERR( "  Incorrect file size" );
		goto ERROR;
	}

    CRC_HandleTypeDef CrcHandle;
    volatile uint32_t calculatedCrc = 0;
    __HAL_RCC_CRC_CLK_ENABLE();
    CrcHandle.Instance                     = CRC;
    CrcHandle.State                        = HAL_CRC_STATE_RESET;
    if(HAL_CRC_Init(&CrcHandle) != HAL_OK){
		PRINT_ERR( "  CRC init error" );
		goto ERROR;
    }

	PRINT_RAW( "  CRC.." );
	f_rewind(fp);
	uint32_t scan = 0;
	uint32_t boundary = (APP1_SIZE+4)/512;
	for( scan=0; scan<boundary; scan++ ){
		res = f_read( fp, buff, 512, &br );
		if(res!=FR_OK || br!=512){
			PRINT_ERR( "f_read error [0x%02X] byte read=%d", res, br );
			goto ERROR;
		}
		// Decryption 
	#if DECRYPTION_ENABLED
		btea_decrpyt(buff,TEA_key);
	#endif
		// Verification
		if( scan == 0 ){ // First unit
			if( ((*(uint32_t*)buff - RAM_BASE) > RAM_SIZE) ){
				PRINT_RAW( "........................ABORT\r\n" );
				PRINT_ERR( "  Bad MSP[0x%08X]", *(uint32_t*)buff );
				goto ERROR;
			}
			calculatedCrc = HAL_CRC_Accumulate(&CrcHandle, (uint32_t*)buff, 512/4);
		}else if( scan == boundary-1 ){ // Last unit
			calculatedCrc = HAL_CRC_Accumulate(&CrcHandle, (uint32_t*)buff, (512-4)/4);
		}else{
			calculatedCrc = HAL_CRC_Accumulate(&CrcHandle, (uint32_t*)buff, 512/4);
		}
		if( scan%64 == 0 ){
			PRINT_RAW( "." );
		}
		led_filling( RGB(0xAD,0x3D,0x00), 150 );
	}
	
	uint32_t fileCrc = *(uint32_t*)&(buff[512-4]);	
    if( fileCrc != calculatedCrc ){
		PRINT_RAW( "CRC unmatched. [%08X/%08X]", fileCrc, calculatedCrc );
		goto ERROR;
    }else{
		PRINT_RAW( "CRC matched. [%08X]\r\n", fileCrc );
	}

	PRINT_INF( "  %s is verified", UPGRADE_FILENAME );
    return true;
ERROR:
	PRINT_INF( "  %s cannot be used", UPGRADE_FILENAME );
    __HAL_RCC_CRC_FORCE_RESET();
    __HAL_RCC_CRC_RELEASE_RESET();
	return false;
}


bool IsUpgradeFileExists( void ){
	FRESULT res;
	FILINFO fno;
	PRINT_RAW("Finding \"%s\"......", UPGRADE_FILENAME);
	res = f_stat(UPGRADE_FILENAME, &fno);
    if(res != FR_OK){
		PRINT_INF("NOTFOUND");
        return false;
	}
	PRINT_INF("FOUND");
	PRINT_INF("  %s %dbytes"
	,	fno.fname
	,	fno.fsize
	);
	return true;
}

bool IsBackupFileExists( void ){
	FRESULT res;
	FILINFO fno;
	PRINT_RAW("Finding \"%s\".......", BACKUP_FILENAME);
	res = f_stat(BACKUP_FILENAME, &fno);
    if(res != FR_OK){
		PRINT_INF("NOTFOUND");
        return false;
	}
	PRINT_INF("FOUND");
	PRINT_INF("  %s %dbytes"
	,	fno.fname
	,	fno.fsize
	);
	return true;
}


bool IsApp1Jumpable( void ){
	PRINT_RAW("Checking for App 1.............");
    // Check if there is application in user flash area
    if(Bootloader_CheckForApp1() == BL_OK){
#if(USE_CHECKSUM)
		// Verify application checksum 
		if(Bootloader_IsApp1ChecksumValid() != BL_OK){
			PRINT_RAW("BAD\r\n");
			return false;
		}else{
			PRINT_RAW("PASS\r\n");
			return true;
		}
#endif
	}else{
		PRINT_RAW("NOTFOUND\r\n");
		return false;
	}
}



void printMem( const char *pTag, void *addr, unsigned int n ){
	int i=0;
	if( !n ){
		return;
	}
	printf( "\r\n\x1B[1;32m[M] Addr=0x%X ""%s""\x1B[0;32m" "\r\n" "\x1B[4;92m" "     | ", (uint32_t)addr, pTag );
	for( i=0; i<((n>16)?16:n); i++ ){
		printf( " %X|", i, i+16 );
	}
	for( i=0; i<((n<16)?n:(((n-1)/16+1)*16)); i++ ){
		if( i%16 == 0 ){
			printf( "\x1B[4;92m""\r\n""%4XH|""\x1B[0;39m"" ", i ); //\x1B[4;32m
		}
		if( i < n ){
			printf( "%02X ", 0x000000FF & ((uint8_t *)addr)[i] );
		}else{
			printf( "   " );
		}
	}
	printf( "\x1B[0;39m""\r\n\n" );
}

static uint8_t buff[4096];
bool GenerateRC_UpgradeFile( FIL* fp ){
	FRESULT res;
	UINT br, bw;
	FIL rc_upgrade_file;
	PRINT_INF("Generating "RC_UPGRADE_FILENAME );
	res = f_open( &rc_upgrade_file, RC_UPGRADE_FILENAME, FA_CREATE_ALWAYS|FA_WRITE );
	if( res != FR_OK ){
		PRINT_INF("Failed to create "RC_UPGRADE_FILENAME );
		return false;
	}
	res = f_lseek( fp, OWL_UPGRADE_FILESIZE );
	if( res != FR_OK ){
		PRINT_INF("Failed to seek 0x%08X", OWL_UPGRADE_FILESIZE );
		return false;
	}
	while( !f_eof(fp) ){
		res = f_read( fp, buff, sizeof(buff), &br );
		if( res!=FR_OK ){
			PRINT_ERR( "Error while reading [%d,%d]", res, br );
			return false;
		}
		res = f_write( &rc_upgrade_file, buff, br, &bw );
		if( res!=FR_OK ){
			PRINT_ERR( "Error while writing [%d,%d]", res, bw );
			return false;
		}
		led_filling( RGB(0xAD,0x3D,0x00), 150 );
	}
	f_close( &rc_upgrade_file );
	return true;
}


