JerrickRowe/stm32-bootloader/projects/STM32F407-OWL/source/main.c
//			HAL_Delay(200);
//			led_setAllRGB( RGB(0,0,0) );
//			while(1){
//				if( !bsp_power_isExtPowerOnline() ){
//					bsp_power_ReleasePower();
//				}
//			}
		}
		

		// No need to upgrade or upgrade failed.
		if( IsApp1Jumpable() == true ){
			LaunchApp1();
		}

		// App is broken, try to recover from backup file
		if( IsBackupFileExists() == true ){
			FRESULT res;
			PRINT_RAW("Recover backup file......");
			res = f_rename( BACKUP_FILENAME, UPGRADE_FILENAME );
			if( res == FR_OK ){
				PRINT_RAW("DONE\r\n");
				if( UpgradeFromSD() == true ){
					// renew_freefile = true;
					LaunchApp1();
				}
			}else{
				PRINT_RAW("FAILED\r\n");
			}
		}
	}else{
		// Run USB service if sdcard is online
		if( IsSDcardOnline() ){
			PRINT_INF(	"SDcard is online" );
			// Run USB-OTG service
			float usb_volt = bsp_power_GetExtPowerVoltage();
			PRINT_INF(	"USB voltage = %.2fV", usb_volt );
			if( usb_volt>3.0f && usb_volt<7.0f ){
				while( USB_OTG() );
			}
		}
		// Try to run app without SD card.
		if( IsApp1Jumpable() == true ){
			LaunchApp1();
		}
	}
	
	// Fatal: no app, no backup file available, upgrade is needed.
    PRINT_INF("No application available.");
    while(1){
		led_setAllRGB( RGB(20,20,20) );
		HAL_Delay(150);
		led_setAllRGB( RGB(0,0,0) );
		HAL_Delay(150);
    }
}

/*** Bootloader ***************************************************************/

void Enter_Bootloader(void)
{
//    FRESULT  res;
//    UINT     num;
//    uint8_t  i;
//    uint8_t  status;
//    uint64_t data;
//    uint32_t cntr;
//    uint32_t addr;
//    char     msg[40] = {0x00};

//    /* Check for flash write protection */
//    if(Bootloader_GetProtectionStatus() & BL_PROTECTION_WRP)
//    {
//        PRINT_INF("Application space in flash is write protected.");
//        PRINT_INF("Press button to disable flash write protection...");
//        LED_R_ON();
//        for(i = 0; i < 100; ++i)
//        {
//            LED_Y_TG();
//            HAL_Delay(50);
//            if(IS_BTN_PRESSED())
//            {
//                PRINT_INF("Disabling write protection and generating system "
//                      "reset...");
//                Bootloader_ConfigProtection(BL_PROTECTION_NONE);
//            }
//        }
//        LED_R_OFF();
//        LED_Y_OFF();
//        PRINT_INF("Button was not pressed, write protection is still active.");
//        PRINT_INF("Exiting Bootloader.");
//        return;
//    }

//    /* Initialize SD card */
//    if(SD_Init())
//    {
//        /* SD init failed */
//        PRINT_INF("SD card cannot be initialized.");
//        return;
//    }

//    /* Mount SD card */
//    res = f_mount(&SDFatFs, (TCHAR const*)SDPath, 1);
//    if(res != FR_OK)
//    {
//        /* f_mount failed */
//        PRINT_INF("SD card cannot be mounted.");
//        sprintf(msg, "FatFs error code: %u", res);
//        PRINT_INF("%s",msg);
//        return;
//    }
//    PRINT_INF("SD mounted.");

//    /* Open file for programming */
//    res = f_open(&SDFile, CONF_FILENAME, FA_READ);
//    if(res != FR_OK)
//    {
//        /* f_open failed */
//        PRINT_INF("File cannot be opened.");
//        sprintf(msg, "FatFs error code: %u", res);
//        PRINT_INF("%s",msg);

//        SD_Eject();
//        PRINT_INF("SD ejected.");
//        return;
//    }
//    PRINT_INF("Software found on SD.");

//    /* Check size of application found on SD card */
//    if(Bootloader_CheckSize(f_size(&SDFile)) != BL_OK)
//    {
//        PRINT_INF("Error: app on SD card is too large.");

//        f_close(&SDFile);
//        SD_Eject();
//        PRINT_INF("SD ejected.");
//        return;
//    }
//    PRINT_INF("App size OK.");

//    /* Step 1: Init Bootloader and Flash */
//    Bootloader_Init();

//    /* Step 2: Erase Flash */
//    PRINT_INF("Erasing flash...");
//    LED_Y_ON();
//    Bootloader_Erase();
//    LED_Y_OFF();
//    PRINT_INF("Flash erase finished.");

//    /* If BTN is pressed, then skip programming */
//    if(IS_BTN_PRESSED())
//    {
//        PRINT_INF("Programming skipped.");

//        f_close(&SDFile);
//        SD_Eject();
//        PRINT_INF("SD ejected.");
//        return;
//    }

//    /* Step 3: Programming */
//    PRINT_INF("Starting programming...");
//    LED_Y_ON();
//    cntr = 0;
//    Bootloader_FlashBegin();
//    do
//    {
//        data = 0xFFFFFFFFFFFFFFFF;
//        res   = f_read(&SDFile, &data, 8, &num);
//        if(num)
//        {
//            status = Bootloader_FlashNext(data);
//            if(status == BL_OK)
//            {
//                cntr++;
//            }
//            else
//            {
//                sprintf(msg, "Programming error at: %lu byte", (cntr * 8));
//				PRINT_INF("%s",msg);

//                f_close(&SDFile);
//                SD_Eject();
//                PRINT_INF("SD ejected.");

//                LED_G_OFF();
//                LED_Y_OFF();
//                return;
//            }
//        }
//        if(cntr % 256 == 0)
//        {
//            /* Toggle green LED during programming */
//            LED_G_TG();
//        }
//    } while((res == FR_OK) && (num > 0));

//    /* Step 4: Finalize Programming */
//    Bootloader_FlashEnd();
//    f_close(&SDFile);
//    LED_G_OFF();
//    LED_Y_OFF();
//    PRINT_INF("Programming finished.");
//    sprintf(msg, "Flashed: %lu bytes.", (cntr * 8));
//    PRINT_INF("%s",msg);

//    /* Open file for verification */
//    res = f_open(&SDFile, CONF_FILENAME, FA_READ);
//    if(res != FR_OK)
//    {
//        /* f_open failed */
//        PRINT_INF("File cannot be opened.");
//        sprintf(msg, "FatFs error code: %u", res);
//        PRINT_INF("%s",msg);

//        SD_Eject();
//        PRINT_INF("SD ejected.");
//        return;
//    }

//    /* Step 5: Verify Flash Content */
//    addr = APP_ADDRESS;
//    cntr = 0;
//    do
//    {
//        data = 0xFFFFFFFFFFFFFFFF;
//        res   = f_read(&SDFile, &data, 4, &num);
//        if(num)
//        {
//            if(*(uint32_t*)addr == (uint32_t)data)
//            {
//                addr += 4;
//                cntr++;
//            }
//            else
//            {
//                sprintf(msg, "Verification error at: %lu byte.", (cntr * 4));
//				PRINT_INF("%s",msg);

//                f_close(&SDFile);
//                SD_Eject();
//                PRINT_INF("SD ejected.");

